<header>
	CSS › <h1>Einführung</h1>
</header>

<p>HTML war urspr&uuml;nglich nur f&uuml;r die Formatierung wissenschaftlicher Textdokumente gedacht, wurde aber bereits nach kurzer Zeit zum Erstellen von Homepages nach heutigem Verst&auml;ndnis verwendet. Dabei wurde das Aussehen der Seite durch verschiedene Tags innerhalb des HTML-Codes ver&auml;ndert. Diese Art Websites zu erstellen f&uuml;hrte zu einem extrem un&uuml;bersichtlichen, redundanten Code. Deshalb wurde 1993 CSS entwickelt, das 1996 zum Standard erkl&auml;rt wurde. CSS steht f&uuml;r &bdquo;Cascading Style Sheets&ldquo;. Es handelt sich dabei um eine Sprache, mit der das Aussehen von HTML-Tags beeinflusst werden kann.</p>
				
<p>Heute definiert man in seinem HTML-Dokument also nur noch die <b>Struktur</b> der Website (mit Hilfe der oben genannten Strukturtags) sowie die <b>Art</b> des Inhalts  (mit Hilfe der Tags zur Textauszeichnung &ndash; also z. B. <span class="tag">&lt;h1&gt;</span> als &bdquo;&Uuml;berschrift ersten Grades&ldquo;). In der CSS-Datei (auch &bdquo;Stylesheet&ldquo; genannt) definiert man dann, wie die verschiedenen Tags vom Browser dargestellt werden sollen (also z. B. &bdquo;Das Tag <span class="tag">&lt;h1&gt;</span> soll die Schriftgr&ouml;&szlig;e 30px, den Zeilenabstand 35px und den Schriftschnitt bold bewirken&ldquo;). Dabei ist man v&ouml;llig frei und muss sich an keine Vorgaben halten (man k&ouml;nnte also z. B. definieren, dass <span class="tag">&lt;h1&gt;</span> in einer kleineren Schriftgr&ouml;&szlig;e angezeigt wird als <span class="tag">&lt;h2&gt;</span>).</p>
				
<p>Dass <span class="tag">&lt;h1&gt;</span> bereits bei reinen HTML-Dokumenten bewirkte, dass der damit ausgezeichnete Text gr&ouml;&szlig;er dargestellt wurde, liegt daran, dass der Browser bereits von sich aus eine eingebaute CSS-Datei besitzt, die das Aussehen einiger HTML-Tags vorbestimmt. Rein theoretisch w&uuml;rde kein HTML-Tag eine optische Ver&auml;nderung bewirken. Die vom Browser vorgegebene CSS-Datei wird von eigenen CSS-Dateien &uuml;berschrieben.</p>
				
<p>Nicht ganz genau dem im vorletzten Abschnitt genannten Schema entsprechen die Tags zur Textauszeichnung, die bereits nach einer optischen Ver&auml;nderung benannt sind (also z. B. <span class="tag">&lt;b&gt;</span> wie &bdquo;bold&ldquo;) &ndash; das vorgegebene Aussehen dieser Tags mit CSS zu ver&auml;ndern, ist zwar technisch m&ouml;glich, ergibt aber keinen Sinn.	</p>